In [1]:

import pandas as pd

df = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie'],
    'age': [25, 30, 35]
}, index=['a', 'b', 'c'])

In [2]:
df

      name  age
a    Alice   25
b      Bob   30
c  Charlie   35

In [5]:
df.tail(2)

      name  age
b      Bob   30
c  Charlie   35

In [6]:
df.shape

(3, 2)

In [7]:
df.columns

Index(['name', 'age'], dtype='object')

In [3]:
df.describe()

        age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [4]:
df.shape

(3, 2)

In [5]:
df.columns

Index(['name', 'age'], dtype='object')

In [7]:
df

      name  age
a    Alice   25
b      Bob   30
c  Charlie   35

In [8]:
df.iloc[0]         # First row (index 0)

name    Alice
age        25
Name: a, dtype: object

In [11]:
# Output: name Alice, age 25

df.iloc[2, 0]      # Row 0, Column 1 → 25

'Charlie'

In [28]:
df.iloc[:, 0]      # All rows, Column 0 → names

a      Alice
b        Bob
c    Charlie
Name: name, dtype: object

In [29]:
df.loc['a']        # Row with label 'a'

name    Alice
age        25
Name: a, dtype: object

In [30]:
# Output: name Alice, age 25

df.loc['a', 'age'] # 25

25

In [32]:
df.loc[:,'name']  # All names

a      Alice
b        Bob
c    Charlie
Name: name, dtype: object